Revit 2027 API
Element.IsValidType(Document, ICollection<ElementId>, ElementId) Method
 Checks if given type is valid for the set of elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidType(
	Document document,
	ICollection<ElementId> elementIds,
	ElementId typeId
)
Public Shared Function IsValidType (
	document As Document,
	elementIds As ICollection(Of ElementId),
	typeId As ElementId
) As Boolean
public:
static bool IsValidType(
	Document^ document,
	ICollection<ElementId^>^ elementIds,
	ElementId^ typeId
)
static member IsValidType :
        document : Document *
        elementIds : ICollection<ElementId> *
        typeId : ElementId -> bool
Parameters
document Document
 The document.
elementIds ICollection<ElementId>
 A collection of element IDs.
typeId ElementId
 ElementId of the type to check.
Return Value
Boolean
 True if all elements can have a type assigned and this type is valid for all elements, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  Thrown when at least one of the elements does not exist in the document.
ArgumentNullException |  A non-optional argument was null
Remarks
 A type is valid for the set of elements if it is valid for each and every element in the set.
See Also
Reference
Element Class
IsValidType Overload
Autodesk.Revit.DB Namespace